<?php //*********************************模組檔案引入********************************* ?>
<?php include("../../Module/pMwm.php"); ?>
<?php //**************************************************************************** ?>

<?php //*********************************前置變數定義********************************* ?>
<?php
// ===========================================================================
// 初始化參數宣告
// ===========================================================================
ErrorReporting(E_ERROR | E_WARNING | E_PARSE);     //錯誤回報控制 0關掉 E_ALL全部回報
ChkLogin();                                        //檢查是否登入
$hdnOp=$_POST["hdnOp"];                            //表單固定參數
$_SESSION["sSQLFile"]="PRO/PRO0401.sql";  //SQL檔路徑

// ===========================================================================
// 接收參數宣告
// ===========================================================================
$ci01_value=$_GET["ci01"];
$FrontID=$_GET["FrontID"];
$Level=$_GET["Level"];

$ci01=uniDecode($ci01_value,'utf-8');

uLog("ci01 == [".$ci01."]");
uLog("FrontID == [".$FrontID."]");
uLog("Level == [".$Level."]");

// ===========================================================================
// 表單參數宣告
// ===========================================================================

// ===========================================================================
// 資料列表參數宣告
// ===========================================================================

?>
<?php //**************************************************************************** ?>

<?php //*********************************程式邏輯演算********************************* ?>
<?php
if ($ci01!="") {
	$aParme=Array($ci01);
	$sSQL=SQLQuryI($_SESSION["sSQLFile"], "qury08", $aParme);
	$rRs=GetRs($sSQL);
	echo "obj.options[obj.options.length] = new Option('請選擇','');\n";
	$sSQLCountry="select * from citys where ci01='".$ci01."'";
	$iLoopForCountry=0;
	$rRs=GetRs($sSQLCountry);
	while ($row = mysql_fetch_array($rRs, MYSQL_ASSOC)) {
		echo "obj.options[obj.options.length] = new Option('".Trim($row["ci02"])."','".(Trim($row["ci02"]))."');\n";
	}
	mysql_free_result($rRs);
	return;

}

?>
<?php //**************************************************************************** ?>

<?php //*********************************其它模組專區********************************* ?>
<?php
function uniDecode($str,$charcode){
	$text = preg_replace_callback("/%u[0-9A-Za-z]{4}/",toUtf8,$str);
	return mb_convert_encoding($text, $charcode, 'utf-8');
}

function toUtf8($ar){
	foreach($ar as $val){
		$val = intval(substr($val,2),16);
		if($val < 0x7F){        // 0000-007F
			$c .= chr($val);
		}elseif($val < 0x800) { // 0080-0800
			$c .= chr(0xC0 | ($val / 64));
			$c .= chr(0x80 | ($val % 64));
		}else{                // 0800-FFFF
			$c .= chr(0xE0 | (($val / 64) / 64));
			$c .= chr(0x80 | (($val / 64) % 64));
			$c .= chr(0x80 | ($val % 64));
		}
	}
	return $c;
}

?>
<?php //**************************************************************************** ?>